# Pandas

In [23]:
import pandas as pd

## DataFrame

In [24]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 1490158]
}

df = pd.DataFrame(data)
df.index = ['서울', '부산', '인천', '대구']
df

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  1490158

In [25]:
data = [
    [9904312, 3448737, 2890451, 2466052],
    [9631482, 3393191, 2632035, 1490158]
]
idx = ['2015', '2010']
col = ['서울', '부산', '인천', '대구']

df2 = pd.DataFrame(data, index=idx, columns=col)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9631482  3393191  2632035  1490158

In [29]:
# 전치행렬
df2.T

       2015     2010
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  1490158

### 연습

In [37]:
name = ['홍길동', '김사또', '임꺽정']
h = [175.3, 180.2, 178.6]
w = [66.2, 78.9, 55.1]
age = [27.0, 49.0, 35.0]

idx = ['키', '몸무게', '나이']
data = [h, w, age]

df3 = pd.DataFrame(data, columns=name, index=idx)
df3

       홍길동    김사또    임꺽정
키    175.3  180.2  178.6
몸무게   66.2   78.9   55.1
나이    27.0   49.0   35.0